MikroElektronika/core_packages/PIC/XC8/def/PIC12LF1612/mcu.h
// Register: CCP2CAP
#define CCP2CAP CCP2CAP
extern volatile unsigned char           CCP2CAP             __at(0x29B);
#ifndef _LIB_BUILD
asm("CCP2CAP equ 029Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CTS                    :8;
    };
    struct {
        unsigned CTS0                   :1;
        unsigned CTS1                   :1;
    };
    struct {
        unsigned CCP2CTS                :8;
    };
    struct {
        unsigned CCP2CTS0               :1;
        unsigned CCP2CTS1               :1;
    };
} CCP2CAPbits_t;
extern volatile CCP2CAPbits_t CCP2CAPbits __at(0x29B);
// bitfield macros
#define _CCP2CAP_CTS_POSN                                   0x0
#define _CCP2CAP_CTS_POSITION                               0x0
#define _CCP2CAP_CTS_SIZE                                   0x8
#define _CCP2CAP_CTS_LENGTH                                 0x8
#define _CCP2CAP_CTS_MASK                                   0xFF
#define _CCP2CAP_CTS0_POSN                                  0x0
#define _CCP2CAP_CTS0_POSITION                              0x0
#define _CCP2CAP_CTS0_SIZE                                  0x1
#define _CCP2CAP_CTS0_LENGTH                                0x1
#define _CCP2CAP_CTS0_MASK                                  0x1
#define _CCP2CAP_CTS1_POSN                                  0x1
#define _CCP2CAP_CTS1_POSITION                              0x1
#define _CCP2CAP_CTS1_SIZE                                  0x1
#define _CCP2CAP_CTS1_LENGTH                                0x1
#define _CCP2CAP_CTS1_MASK                                  0x2
#define _CCP2CAP_CCP2CTS_POSN                               0x0
#define _CCP2CAP_CCP2CTS_POSITION                           0x0
#define _CCP2CAP_CCP2CTS_SIZE                               0x8
#define _CCP2CAP_CCP2CTS_LENGTH                             0x8
#define _CCP2CAP_CCP2CTS_MASK                               0xFF
#define _CCP2CAP_CCP2CTS0_POSN                              0x0
#define _CCP2CAP_CCP2CTS0_POSITION                          0x0
#define _CCP2CAP_CCP2CTS0_SIZE                              0x1
#define _CCP2CAP_CCP2CTS0_LENGTH                            0x1
#define _CCP2CAP_CCP2CTS0_MASK                              0x1
#define _CCP2CAP_CCP2CTS1_POSN                              0x1
#define _CCP2CAP_CCP2CTS1_POSITION                          0x1
#define _CCP2CAP_CCP2CTS1_SIZE                              0x1
#define _CCP2CAP_CCP2CTS1_LENGTH                            0x1
#define _CCP2CAP_CCP2CTS1_MASK                              0x2

// Register: CCPTMRS
#define CCPTMRS CCPTMRS
extern volatile unsigned char           CCPTMRS             __at(0x29E);
#ifndef _LIB_BUILD
asm("CCPTMRS equ 029Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP1TSEL               :2;
        unsigned CCP2TSEL               :2;
    };
    struct {
        unsigned CCP1TSEL0              :1;
        unsigned CCP1TSEL1              :1;
        unsigned CCP2TSEL0              :1;
        unsigned CCP2TSEL1              :1;
    };
} CCPTMRSbits_t;
extern volatile CCPTMRSbits_t CCPTMRSbits __at(0x29E);
// bitfield macros
#define _CCPTMRS_CCP1TSEL_POSN                              0x0
#define _CCPTMRS_CCP1TSEL_POSITION                          0x0
#define _CCPTMRS_CCP1TSEL_SIZE                              0x2
#define _CCPTMRS_CCP1TSEL_LENGTH                            0x2
#define _CCPTMRS_CCP1TSEL_MASK                              0x3
#define _CCPTMRS_CCP2TSEL_POSN                              0x2
#define _CCPTMRS_CCP2TSEL_POSITION                          0x2
#define _CCPTMRS_CCP2TSEL_SIZE                              0x2
#define _CCPTMRS_CCP2TSEL_LENGTH                            0x2
#define _CCPTMRS_CCP2TSEL_MASK                              0xC
#define _CCPTMRS_CCP1TSEL0_POSN                             0x0
#define _CCPTMRS_CCP1TSEL0_POSITION                         0x0
#define _CCPTMRS_CCP1TSEL0_SIZE                             0x1
#define _CCPTMRS_CCP1TSEL0_LENGTH                           0x1
#define _CCPTMRS_CCP1TSEL0_MASK                             0x1
#define _CCPTMRS_CCP1TSEL1_POSN                             0x1
#define _CCPTMRS_CCP1TSEL1_POSITION                         0x1
#define _CCPTMRS_CCP1TSEL1_SIZE                             0x1
#define _CCPTMRS_CCP1TSEL1_LENGTH                           0x1
#define _CCPTMRS_CCP1TSEL1_MASK                             0x2
#define _CCPTMRS_CCP2TSEL0_POSN                             0x2
#define _CCPTMRS_CCP2TSEL0_POSITION                         0x2
#define _CCPTMRS_CCP2TSEL0_SIZE                             0x1
#define _CCPTMRS_CCP2TSEL0_LENGTH                           0x1
#define _CCPTMRS_CCP2TSEL0_MASK                             0x4
#define _CCPTMRS_CCP2TSEL1_POSN                             0x3
#define _CCPTMRS_CCP2TSEL1_POSITION                         0x3
#define _CCPTMRS_CCP2TSEL1_SIZE                             0x1
#define _CCPTMRS_CCP2TSEL1_LENGTH                           0x1
#define _CCPTMRS_CCP2TSEL1_MASK                             0x8

// Register: SLRCONA
#define SLRCONA SLRCONA
extern volatile unsigned char           SLRCONA             __at(0x30C);
#ifndef _LIB_BUILD
asm("SLRCONA equ 030Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SLRA0                  :1;
        unsigned SLRA1                  :1;
        unsigned SLRA2                  :1;
        unsigned                        :1;
        unsigned SLRA4                  :1;
        unsigned SLRA5                  :1;
    };
} SLRCONAbits_t;
extern volatile SLRCONAbits_t SLRCONAbits __at(0x30C);
// bitfield macros
#define _SLRCONA_SLRA0_POSN                                 0x0
#define _SLRCONA_SLRA0_POSITION                             0x0
#define _SLRCONA_SLRA0_SIZE                                 0x1
#define _SLRCONA_SLRA0_LENGTH                               0x1
#define _SLRCONA_SLRA0_MASK                                 0x1
#define _SLRCONA_SLRA1_POSN                                 0x1
#define _SLRCONA_SLRA1_POSITION                             0x1
#define _SLRCONA_SLRA1_SIZE                                 0x1
#define _SLRCONA_SLRA1_LENGTH                               0x1
#define _SLRCONA_SLRA1_MASK                                 0x2
#define _SLRCONA_SLRA2_POSN                                 0x2
#define _SLRCONA_SLRA2_POSITION                             0x2
#define _SLRCONA_SLRA2_SIZE                                 0x1
#define _SLRCONA_SLRA2_LENGTH                               0x1
#define _SLRCONA_SLRA2_MASK                                 0x4
#define _SLRCONA_SLRA4_POSN                                 0x4
#define _SLRCONA_SLRA4_POSITION                             0x4
#define _SLRCONA_SLRA4_SIZE                                 0x1
#define _SLRCONA_SLRA4_LENGTH                               0x1
#define _SLRCONA_SLRA4_MASK                                 0x10
#define _SLRCONA_SLRA5_POSN                                 0x5
#define _SLRCONA_SLRA5_POSITION                             0x5
#define _SLRCONA_SLRA5_SIZE                                 0x1
#define _SLRCONA_SLRA5_LENGTH                               0x1
#define _SLRCONA_SLRA5_MASK                                 0x20

