MikroElektronika/core_packages/PIC/XC8/def/PIC12LF1612/mcu.h
// Register: SMT1CON1
#define SMT1CON1 SMT1CON1
extern volatile unsigned char           SMT1CON1            __at(0xD99);
#ifndef _LIB_BUILD
asm("SMT1CON1 equ 0D99h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MODE                   :4;
        unsigned                        :2;
        unsigned REPEAT                 :1;
        unsigned SMT1GO                 :1;
    };
    struct {
        unsigned MODE0                  :1;
        unsigned MODE1                  :1;
        unsigned MODE2                  :1;
        unsigned MODE3                  :1;
    };
    struct {
        unsigned SMT1MODE               :4;
        unsigned                        :2;
        unsigned SMT1REPEAT             :1;
    };
    struct {
        unsigned SMT1MODE0              :1;
        unsigned SMT1MODE1              :1;
        unsigned SMT1MODE2              :1;
        unsigned SMT1MODE3              :1;
    };
} SMT1CON1bits_t;
extern volatile SMT1CON1bits_t SMT1CON1bits __at(0xD99);
// bitfield macros
#define _SMT1CON1_MODE_POSN                                 0x0
#define _SMT1CON1_MODE_POSITION                             0x0
#define _SMT1CON1_MODE_SIZE                                 0x4
#define _SMT1CON1_MODE_LENGTH                               0x4
#define _SMT1CON1_MODE_MASK                                 0xF
#define _SMT1CON1_REPEAT_POSN                               0x6
#define _SMT1CON1_REPEAT_POSITION                           0x6
#define _SMT1CON1_REPEAT_SIZE                               0x1
#define _SMT1CON1_REPEAT_LENGTH                             0x1
#define _SMT1CON1_REPEAT_MASK                               0x40
#define _SMT1CON1_SMT1GO_POSN                               0x7
#define _SMT1CON1_SMT1GO_POSITION                           0x7
#define _SMT1CON1_SMT1GO_SIZE                               0x1
#define _SMT1CON1_SMT1GO_LENGTH                             0x1
#define _SMT1CON1_SMT1GO_MASK                               0x80
#define _SMT1CON1_MODE0_POSN                                0x0
#define _SMT1CON1_MODE0_POSITION                            0x0
#define _SMT1CON1_MODE0_SIZE                                0x1
#define _SMT1CON1_MODE0_LENGTH                              0x1
#define _SMT1CON1_MODE0_MASK                                0x1
#define _SMT1CON1_MODE1_POSN                                0x1
#define _SMT1CON1_MODE1_POSITION                            0x1
#define _SMT1CON1_MODE1_SIZE                                0x1
#define _SMT1CON1_MODE1_LENGTH                              0x1
#define _SMT1CON1_MODE1_MASK                                0x2
#define _SMT1CON1_MODE2_POSN                                0x2
#define _SMT1CON1_MODE2_POSITION                            0x2
#define _SMT1CON1_MODE2_SIZE                                0x1
#define _SMT1CON1_MODE2_LENGTH                              0x1
#define _SMT1CON1_MODE2_MASK                                0x4
#define _SMT1CON1_MODE3_POSN                                0x3
#define _SMT1CON1_MODE3_POSITION                            0x3
#define _SMT1CON1_MODE3_SIZE                                0x1
#define _SMT1CON1_MODE3_LENGTH                              0x1
#define _SMT1CON1_MODE3_MASK                                0x8
#define _SMT1CON1_SMT1MODE_POSN                             0x0
#define _SMT1CON1_SMT1MODE_POSITION                         0x0
#define _SMT1CON1_SMT1MODE_SIZE                             0x4
#define _SMT1CON1_SMT1MODE_LENGTH                           0x4
#define _SMT1CON1_SMT1MODE_MASK                             0xF
#define _SMT1CON1_SMT1REPEAT_POSN                           0x6
#define _SMT1CON1_SMT1REPEAT_POSITION                       0x6
#define _SMT1CON1_SMT1REPEAT_SIZE                           0x1
#define _SMT1CON1_SMT1REPEAT_LENGTH                         0x1
#define _SMT1CON1_SMT1REPEAT_MASK                           0x40
#define _SMT1CON1_SMT1MODE0_POSN                            0x0
#define _SMT1CON1_SMT1MODE0_POSITION                        0x0
#define _SMT1CON1_SMT1MODE0_SIZE                            0x1
#define _SMT1CON1_SMT1MODE0_LENGTH                          0x1
#define _SMT1CON1_SMT1MODE0_MASK                            0x1
#define _SMT1CON1_SMT1MODE1_POSN                            0x1
#define _SMT1CON1_SMT1MODE1_POSITION                        0x1
#define _SMT1CON1_SMT1MODE1_SIZE                            0x1
#define _SMT1CON1_SMT1MODE1_LENGTH                          0x1
#define _SMT1CON1_SMT1MODE1_MASK                            0x2
#define _SMT1CON1_SMT1MODE2_POSN                            0x2
#define _SMT1CON1_SMT1MODE2_POSITION                        0x2
#define _SMT1CON1_SMT1MODE2_SIZE                            0x1
#define _SMT1CON1_SMT1MODE2_LENGTH                          0x1
#define _SMT1CON1_SMT1MODE2_MASK                            0x4
#define _SMT1CON1_SMT1MODE3_POSN                            0x3
#define _SMT1CON1_SMT1MODE3_POSITION                        0x3
#define _SMT1CON1_SMT1MODE3_SIZE                            0x1
#define _SMT1CON1_SMT1MODE3_LENGTH                          0x1
#define _SMT1CON1_SMT1MODE3_MASK                            0x8

// Register: SMT1STAT
#define SMT1STAT SMT1STAT
extern volatile unsigned char           SMT1STAT            __at(0xD9A);
#ifndef _LIB_BUILD
asm("SMT1STAT equ 0D9Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned AS                     :1;
        unsigned WS                     :1;
        unsigned TS                     :1;
        unsigned                        :2;
        unsigned RST                    :1;
        unsigned CPWUP                  :1;
        unsigned CPRUP                  :1;
    };
    struct {
        unsigned SMT1AS                 :1;
        unsigned SMT1WS                 :1;
        unsigned SMT1TS                 :1;
        unsigned                        :2;
        unsigned SMT1RESET              :1;
        unsigned SMT1CPWUP              :1;
        unsigned SMT1CPRUP              :1;
    };
} SMT1STATbits_t;
