MikroElektronika/core_packages/PIC/XC8/def/PIC12LF1612/mcu.h
extern volatile SMT2CLKbits_t SMT2CLKbits __at(0xDAD);
// bitfield macros
#define _SMT2CLK_CSEL_POSN                                  0x0
#define _SMT2CLK_CSEL_POSITION                              0x0
#define _SMT2CLK_CSEL_SIZE                                  0x8
#define _SMT2CLK_CSEL_LENGTH                                0x8
#define _SMT2CLK_CSEL_MASK                                  0xFF
#define _SMT2CLK_CSEL0_POSN                                 0x0
#define _SMT2CLK_CSEL0_POSITION                             0x0
#define _SMT2CLK_CSEL0_SIZE                                 0x1
#define _SMT2CLK_CSEL0_LENGTH                               0x1
#define _SMT2CLK_CSEL0_MASK                                 0x1
#define _SMT2CLK_CSEL1_POSN                                 0x1
#define _SMT2CLK_CSEL1_POSITION                             0x1
#define _SMT2CLK_CSEL1_SIZE                                 0x1
#define _SMT2CLK_CSEL1_LENGTH                               0x1
#define _SMT2CLK_CSEL1_MASK                                 0x2
#define _SMT2CLK_CSEL2_POSN                                 0x2
#define _SMT2CLK_CSEL2_POSITION                             0x2
#define _SMT2CLK_CSEL2_SIZE                                 0x1
#define _SMT2CLK_CSEL2_LENGTH                               0x1
#define _SMT2CLK_CSEL2_MASK                                 0x4
#define _SMT2CLK_CSEL3_POSN                                 0x3
#define _SMT2CLK_CSEL3_POSITION                             0x3
#define _SMT2CLK_CSEL3_SIZE                                 0x1
#define _SMT2CLK_CSEL3_LENGTH                               0x1
#define _SMT2CLK_CSEL3_MASK                                 0x8
#define _SMT2CLK_CSEL4_POSN                                 0x4
#define _SMT2CLK_CSEL4_POSITION                             0x4
#define _SMT2CLK_CSEL4_SIZE                                 0x1
#define _SMT2CLK_CSEL4_LENGTH                               0x1
#define _SMT2CLK_CSEL4_MASK                                 0x10
#define _SMT2CLK_CSEL5_POSN                                 0x5
#define _SMT2CLK_CSEL5_POSITION                             0x5
#define _SMT2CLK_CSEL5_SIZE                                 0x1
#define _SMT2CLK_CSEL5_LENGTH                               0x1
#define _SMT2CLK_CSEL5_MASK                                 0x20
#define _SMT2CLK_CSEL6_POSN                                 0x6
#define _SMT2CLK_CSEL6_POSITION                             0x6
#define _SMT2CLK_CSEL6_SIZE                                 0x1
#define _SMT2CLK_CSEL6_LENGTH                               0x1
#define _SMT2CLK_CSEL6_MASK                                 0x40
#define _SMT2CLK_CSEL7_POSN                                 0x7
#define _SMT2CLK_CSEL7_POSITION                             0x7
#define _SMT2CLK_CSEL7_SIZE                                 0x1
#define _SMT2CLK_CSEL7_LENGTH                               0x1
#define _SMT2CLK_CSEL7_MASK                                 0x80
#define _SMT2CLK_SMT2CSEL_POSN                              0x0
#define _SMT2CLK_SMT2CSEL_POSITION                          0x0
#define _SMT2CLK_SMT2CSEL_SIZE                              0x8
#define _SMT2CLK_SMT2CSEL_LENGTH                            0x8
#define _SMT2CLK_SMT2CSEL_MASK                              0xFF
#define _SMT2CLK_SMT2CSEL0_POSN                             0x0
#define _SMT2CLK_SMT2CSEL0_POSITION                         0x0
#define _SMT2CLK_SMT2CSEL0_SIZE                             0x1
#define _SMT2CLK_SMT2CSEL0_LENGTH                           0x1
#define _SMT2CLK_SMT2CSEL0_MASK                             0x1
#define _SMT2CLK_SMT2CSEL1_POSN                             0x1
#define _SMT2CLK_SMT2CSEL1_POSITION                         0x1
#define _SMT2CLK_SMT2CSEL1_SIZE                             0x1
#define _SMT2CLK_SMT2CSEL1_LENGTH                           0x1
#define _SMT2CLK_SMT2CSEL1_MASK                             0x2
#define _SMT2CLK_SMT2CSEL2_POSN                             0x2
#define _SMT2CLK_SMT2CSEL2_POSITION                         0x2
#define _SMT2CLK_SMT2CSEL2_SIZE                             0x1
#define _SMT2CLK_SMT2CSEL2_LENGTH                           0x1
#define _SMT2CLK_SMT2CSEL2_MASK                             0x4
#define _SMT2CLK_SMT2CSEL3_POSN                             0x3
#define _SMT2CLK_SMT2CSEL3_POSITION                         0x3
#define _SMT2CLK_SMT2CSEL3_SIZE                             0x1
#define _SMT2CLK_SMT2CSEL3_LENGTH                           0x1
#define _SMT2CLK_SMT2CSEL3_MASK                             0x8
#define _SMT2CLK_SMT2CSEL4_POSN                             0x4
#define _SMT2CLK_SMT2CSEL4_POSITION                         0x4
#define _SMT2CLK_SMT2CSEL4_SIZE                             0x1
#define _SMT2CLK_SMT2CSEL4_LENGTH                           0x1
#define _SMT2CLK_SMT2CSEL4_MASK                             0x10
#define _SMT2CLK_SMT2CSEL5_POSN                             0x5
#define _SMT2CLK_SMT2CSEL5_POSITION                         0x5
#define _SMT2CLK_SMT2CSEL5_SIZE                             0x1
#define _SMT2CLK_SMT2CSEL5_LENGTH                           0x1
#define _SMT2CLK_SMT2CSEL5_MASK                             0x20
#define _SMT2CLK_SMT2CSEL6_POSN                             0x6
#define _SMT2CLK_SMT2CSEL6_POSITION                         0x6
#define _SMT2CLK_SMT2CSEL6_SIZE                             0x1
#define _SMT2CLK_SMT2CSEL6_LENGTH                           0x1
#define _SMT2CLK_SMT2CSEL6_MASK                             0x40
#define _SMT2CLK_SMT2CSEL7_POSN                             0x7
#define _SMT2CLK_SMT2CSEL7_POSITION                         0x7
#define _SMT2CLK_SMT2CSEL7_SIZE                             0x1
#define _SMT2CLK_SMT2CSEL7_LENGTH                           0x1
#define _SMT2CLK_SMT2CSEL7_MASK                             0x80

// Register: SMT2SIG
#define SMT2SIG SMT2SIG
extern volatile unsigned char           SMT2SIG             __at(0xDAE);
#ifndef _LIB_BUILD
asm("SMT2SIG equ 0DAEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSEL                   :8;
    };
    struct {
        unsigned SSEL0                  :1;
        unsigned SSEL1                  :1;
        unsigned SSEL2                  :1;
        unsigned SSEL3                  :1;
        unsigned SSEL4                  :1;
        unsigned SSEL5                  :1;
        unsigned SSEL6                  :1;
        unsigned SSEL7                  :1;
    };
    struct {
        unsigned SMT2SSEL               :8;
    };
    struct {
        unsigned SMT2SSEL0              :1;
        unsigned SMT2SSEL1              :1;
        unsigned SMT2SSEL2              :1;
        unsigned SMT2SSEL3              :1;
        unsigned SMT2SSEL4              :1;
        unsigned SMT2SSEL5              :1;
        unsigned SMT2SSEL6              :1;
        unsigned SMT2SSEL7              :1;
    };
} SMT2SIGbits_t;
