MikroElektronika/core_packages/PIC/XC8/def/PIC12LF1612/mcu.h
extern volatile SMT2SIGbits_t SMT2SIGbits __at(0xDAE);
// bitfield macros
#define _SMT2SIG_SSEL_POSN                                  0x0
#define _SMT2SIG_SSEL_POSITION                              0x0
#define _SMT2SIG_SSEL_SIZE                                  0x8
#define _SMT2SIG_SSEL_LENGTH                                0x8
#define _SMT2SIG_SSEL_MASK                                  0xFF
#define _SMT2SIG_SSEL0_POSN                                 0x0
#define _SMT2SIG_SSEL0_POSITION                             0x0
#define _SMT2SIG_SSEL0_SIZE                                 0x1
#define _SMT2SIG_SSEL0_LENGTH                               0x1
#define _SMT2SIG_SSEL0_MASK                                 0x1
#define _SMT2SIG_SSEL1_POSN                                 0x1
#define _SMT2SIG_SSEL1_POSITION                             0x1
#define _SMT2SIG_SSEL1_SIZE                                 0x1
#define _SMT2SIG_SSEL1_LENGTH                               0x1
#define _SMT2SIG_SSEL1_MASK                                 0x2
#define _SMT2SIG_SSEL2_POSN                                 0x2
#define _SMT2SIG_SSEL2_POSITION                             0x2
#define _SMT2SIG_SSEL2_SIZE                                 0x1
#define _SMT2SIG_SSEL2_LENGTH                               0x1
#define _SMT2SIG_SSEL2_MASK                                 0x4
#define _SMT2SIG_SSEL3_POSN                                 0x3
#define _SMT2SIG_SSEL3_POSITION                             0x3
#define _SMT2SIG_SSEL3_SIZE                                 0x1
#define _SMT2SIG_SSEL3_LENGTH                               0x1
#define _SMT2SIG_SSEL3_MASK                                 0x8
#define _SMT2SIG_SSEL4_POSN                                 0x4
#define _SMT2SIG_SSEL4_POSITION                             0x4
#define _SMT2SIG_SSEL4_SIZE                                 0x1
#define _SMT2SIG_SSEL4_LENGTH                               0x1
#define _SMT2SIG_SSEL4_MASK                                 0x10
#define _SMT2SIG_SSEL5_POSN                                 0x5
#define _SMT2SIG_SSEL5_POSITION                             0x5
#define _SMT2SIG_SSEL5_SIZE                                 0x1
#define _SMT2SIG_SSEL5_LENGTH                               0x1
#define _SMT2SIG_SSEL5_MASK                                 0x20
#define _SMT2SIG_SSEL6_POSN                                 0x6
#define _SMT2SIG_SSEL6_POSITION                             0x6
#define _SMT2SIG_SSEL6_SIZE                                 0x1
#define _SMT2SIG_SSEL6_LENGTH                               0x1
#define _SMT2SIG_SSEL6_MASK                                 0x40
#define _SMT2SIG_SSEL7_POSN                                 0x7
#define _SMT2SIG_SSEL7_POSITION                             0x7
#define _SMT2SIG_SSEL7_SIZE                                 0x1
#define _SMT2SIG_SSEL7_LENGTH                               0x1
#define _SMT2SIG_SSEL7_MASK                                 0x80
#define _SMT2SIG_SMT2SSEL_POSN                              0x0
#define _SMT2SIG_SMT2SSEL_POSITION                          0x0
#define _SMT2SIG_SMT2SSEL_SIZE                              0x8
#define _SMT2SIG_SMT2SSEL_LENGTH                            0x8
#define _SMT2SIG_SMT2SSEL_MASK                              0xFF
#define _SMT2SIG_SMT2SSEL0_POSN                             0x0
#define _SMT2SIG_SMT2SSEL0_POSITION                         0x0
#define _SMT2SIG_SMT2SSEL0_SIZE                             0x1
#define _SMT2SIG_SMT2SSEL0_LENGTH                           0x1
#define _SMT2SIG_SMT2SSEL0_MASK                             0x1
#define _SMT2SIG_SMT2SSEL1_POSN                             0x1
#define _SMT2SIG_SMT2SSEL1_POSITION                         0x1
#define _SMT2SIG_SMT2SSEL1_SIZE                             0x1
#define _SMT2SIG_SMT2SSEL1_LENGTH                           0x1
#define _SMT2SIG_SMT2SSEL1_MASK                             0x2
#define _SMT2SIG_SMT2SSEL2_POSN                             0x2
#define _SMT2SIG_SMT2SSEL2_POSITION                         0x2
#define _SMT2SIG_SMT2SSEL2_SIZE                             0x1
#define _SMT2SIG_SMT2SSEL2_LENGTH                           0x1
#define _SMT2SIG_SMT2SSEL2_MASK                             0x4
#define _SMT2SIG_SMT2SSEL3_POSN                             0x3
#define _SMT2SIG_SMT2SSEL3_POSITION                         0x3
#define _SMT2SIG_SMT2SSEL3_SIZE                             0x1
#define _SMT2SIG_SMT2SSEL3_LENGTH                           0x1
#define _SMT2SIG_SMT2SSEL3_MASK                             0x8
#define _SMT2SIG_SMT2SSEL4_POSN                             0x4
#define _SMT2SIG_SMT2SSEL4_POSITION                         0x4
#define _SMT2SIG_SMT2SSEL4_SIZE                             0x1
#define _SMT2SIG_SMT2SSEL4_LENGTH                           0x1
#define _SMT2SIG_SMT2SSEL4_MASK                             0x10
#define _SMT2SIG_SMT2SSEL5_POSN                             0x5
#define _SMT2SIG_SMT2SSEL5_POSITION                         0x5
#define _SMT2SIG_SMT2SSEL5_SIZE                             0x1
#define _SMT2SIG_SMT2SSEL5_LENGTH                           0x1
#define _SMT2SIG_SMT2SSEL5_MASK                             0x20
#define _SMT2SIG_SMT2SSEL6_POSN                             0x6
#define _SMT2SIG_SMT2SSEL6_POSITION                         0x6
#define _SMT2SIG_SMT2SSEL6_SIZE                             0x1
#define _SMT2SIG_SMT2SSEL6_LENGTH                           0x1
#define _SMT2SIG_SMT2SSEL6_MASK                             0x40
#define _SMT2SIG_SMT2SSEL7_POSN                             0x7
#define _SMT2SIG_SMT2SSEL7_POSITION                         0x7
#define _SMT2SIG_SMT2SSEL7_SIZE                             0x1
#define _SMT2SIG_SMT2SSEL7_LENGTH                           0x1
#define _SMT2SIG_SMT2SSEL7_MASK                             0x80

// Register: SMT2WIN
#define SMT2WIN SMT2WIN
extern volatile unsigned char           SMT2WIN             __at(0xDAF);
#ifndef _LIB_BUILD
asm("SMT2WIN equ 0DAFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned WSEL                   :8;
    };
    struct {
        unsigned WSEL0                  :1;
        unsigned WSEL1                  :1;
        unsigned WSEL2                  :1;
        unsigned WSEL3                  :1;
        unsigned WSEL4                  :1;
        unsigned WSEL5                  :1;
        unsigned WSEL6                  :1;
        unsigned WSEL7                  :1;
    };
    struct {
        unsigned SMT2WSEL               :8;
    };
    struct {
        unsigned SMT2WSEL0              :1;
        unsigned SMT2WSEL1              :1;
        unsigned SMT2WSEL2              :1;
        unsigned SMT2WSEL3              :1;
        unsigned SMT2WSEL4              :1;
        unsigned SMT2WSEL5              :1;
        unsigned SMT2WSEL6              :1;
        unsigned SMT2WSEL7              :1;
    };
} SMT2WINbits_t;
extern volatile SMT2WINbits_t SMT2WINbits __at(0xDAF);
// bitfield macros
#define _SMT2WIN_WSEL_POSN                                  0x0
#define _SMT2WIN_WSEL_POSITION                              0x0
#define _SMT2WIN_WSEL_SIZE                                  0x8
#define _SMT2WIN_WSEL_LENGTH                                0x8
#define _SMT2WIN_WSEL_MASK                                  0xFF
#define _SMT2WIN_WSEL0_POSN                                 0x0
#define _SMT2WIN_WSEL0_POSITION                             0x0
#define _SMT2WIN_WSEL0_SIZE                                 0x1
#define _SMT2WIN_WSEL0_LENGTH                               0x1
#define _SMT2WIN_WSEL0_MASK                                 0x1
#define _SMT2WIN_WSEL1_POSN                                 0x1
#define _SMT2WIN_WSEL1_POSITION                             0x1
#define _SMT2WIN_WSEL1_SIZE                                 0x1
#define _SMT2WIN_WSEL1_LENGTH                               0x1
#define _SMT2WIN_WSEL1_MASK                                 0x2
#define _SMT2WIN_WSEL2_POSN                                 0x2
#define _SMT2WIN_WSEL2_POSITION                             0x2
#define _SMT2WIN_WSEL2_SIZE                                 0x1
#define _SMT2WIN_WSEL2_LENGTH                               0x1
#define _SMT2WIN_WSEL2_MASK                                 0x4
#define _SMT2WIN_WSEL3_POSN                                 0x3
#define _SMT2WIN_WSEL3_POSITION                             0x3
#define _SMT2WIN_WSEL3_SIZE                                 0x1
#define _SMT2WIN_WSEL3_LENGTH                               0x1
#define _SMT2WIN_WSEL3_MASK                                 0x8
#define _SMT2WIN_WSEL4_POSN                                 0x4
#define _SMT2WIN_WSEL4_POSITION                             0x4
#define _SMT2WIN_WSEL4_SIZE                                 0x1
#define _SMT2WIN_WSEL4_LENGTH                               0x1
#define _SMT2WIN_WSEL4_MASK                                 0x10
#define _SMT2WIN_WSEL5_POSN                                 0x5
#define _SMT2WIN_WSEL5_POSITION                             0x5
#define _SMT2WIN_WSEL5_SIZE                                 0x1
#define _SMT2WIN_WSEL5_LENGTH                               0x1
#define _SMT2WIN_WSEL5_MASK                                 0x20
#define _SMT2WIN_WSEL6_POSN                                 0x6
#define _SMT2WIN_WSEL6_POSITION                             0x6
#define _SMT2WIN_WSEL6_SIZE                                 0x1
#define _SMT2WIN_WSEL6_LENGTH                               0x1
#define _SMT2WIN_WSEL6_MASK                                 0x40
#define _SMT2WIN_WSEL7_POSN                                 0x7
#define _SMT2WIN_WSEL7_POSITION                             0x7
#define _SMT2WIN_WSEL7_SIZE                                 0x1
#define _SMT2WIN_WSEL7_LENGTH                               0x1
#define _SMT2WIN_WSEL7_MASK                                 0x80
#define _SMT2WIN_SMT2WSEL_POSN                              0x0
#define _SMT2WIN_SMT2WSEL_POSITION                          0x0
#define _SMT2WIN_SMT2WSEL_SIZE                              0x8
#define _SMT2WIN_SMT2WSEL_LENGTH                            0x8
#define _SMT2WIN_SMT2WSEL_MASK                              0xFF
#define _SMT2WIN_SMT2WSEL0_POSN                             0x0
#define _SMT2WIN_SMT2WSEL0_POSITION                         0x0
#define _SMT2WIN_SMT2WSEL0_SIZE                             0x1
#define _SMT2WIN_SMT2WSEL0_LENGTH                           0x1
#define _SMT2WIN_SMT2WSEL0_MASK                             0x1
#define _SMT2WIN_SMT2WSEL1_POSN                             0x1
#define _SMT2WIN_SMT2WSEL1_POSITION                         0x1
#define _SMT2WIN_SMT2WSEL1_SIZE                             0x1
#define _SMT2WIN_SMT2WSEL1_LENGTH                           0x1
#define _SMT2WIN_SMT2WSEL1_MASK                             0x2
#define _SMT2WIN_SMT2WSEL2_POSN                             0x2
#define _SMT2WIN_SMT2WSEL2_POSITION                         0x2
#define _SMT2WIN_SMT2WSEL2_SIZE                             0x1
#define _SMT2WIN_SMT2WSEL2_LENGTH                           0x1
#define _SMT2WIN_SMT2WSEL2_MASK                             0x4
#define _SMT2WIN_SMT2WSEL3_POSN                             0x3
#define _SMT2WIN_SMT2WSEL3_POSITION                         0x3
#define _SMT2WIN_SMT2WSEL3_SIZE                             0x1
#define _SMT2WIN_SMT2WSEL3_LENGTH                           0x1
#define _SMT2WIN_SMT2WSEL3_MASK                             0x8
#define _SMT2WIN_SMT2WSEL4_POSN                             0x4
#define _SMT2WIN_SMT2WSEL4_POSITION                         0x4
#define _SMT2WIN_SMT2WSEL4_SIZE                             0x1
#define _SMT2WIN_SMT2WSEL4_LENGTH                           0x1
#define _SMT2WIN_SMT2WSEL4_MASK                             0x10
#define _SMT2WIN_SMT2WSEL5_POSN                             0x5
#define _SMT2WIN_SMT2WSEL5_POSITION                         0x5
#define _SMT2WIN_SMT2WSEL5_SIZE                             0x1
#define _SMT2WIN_SMT2WSEL5_LENGTH                           0x1
#define _SMT2WIN_SMT2WSEL5_MASK                             0x20
#define _SMT2WIN_SMT2WSEL6_POSN                             0x6
#define _SMT2WIN_SMT2WSEL6_POSITION                         0x6
#define _SMT2WIN_SMT2WSEL6_SIZE                             0x1
#define _SMT2WIN_SMT2WSEL6_LENGTH                           0x1
#define _SMT2WIN_SMT2WSEL6_MASK                             0x40
#define _SMT2WIN_SMT2WSEL7_POSN                             0x7
#define _SMT2WIN_SMT2WSEL7_POSITION                         0x7
#define _SMT2WIN_SMT2WSEL7_SIZE                             0x1
#define _SMT2WIN_SMT2WSEL7_LENGTH                           0x1
#define _SMT2WIN_SMT2WSEL7_MASK                             0x80

// Register: STATUS_SHAD
#define STATUS_SHAD STATUS_SHAD
extern volatile unsigned char           STATUS_SHAD         __at(0xFE4);
#ifndef _LIB_BUILD
asm("STATUS_SHAD equ 0FE4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned C_SHAD                 :1;
        unsigned DC_SHAD                :1;
        unsigned Z_SHAD                 :1;
    };
} STATUS_SHADbits_t;
extern volatile STATUS_SHADbits_t STATUS_SHADbits __at(0xFE4);
// bitfield macros
#define _STATUS_SHAD_C_SHAD_POSN                            0x0
#define _STATUS_SHAD_C_SHAD_POSITION                        0x0
#define _STATUS_SHAD_C_SHAD_SIZE                            0x1
#define _STATUS_SHAD_C_SHAD_LENGTH                          0x1
#define _STATUS_SHAD_C_SHAD_MASK                            0x1
#define _STATUS_SHAD_DC_SHAD_POSN                           0x1
#define _STATUS_SHAD_DC_SHAD_POSITION                       0x1
#define _STATUS_SHAD_DC_SHAD_SIZE                           0x1
#define _STATUS_SHAD_DC_SHAD_LENGTH                         0x1
#define _STATUS_SHAD_DC_SHAD_MASK                           0x2
#define _STATUS_SHAD_Z_SHAD_POSN                            0x2
#define _STATUS_SHAD_Z_SHAD_POSITION                        0x2
#define _STATUS_SHAD_Z_SHAD_SIZE                            0x1
#define _STATUS_SHAD_Z_SHAD_LENGTH                          0x1
#define _STATUS_SHAD_Z_SHAD_MASK                            0x4

// Register: WREG_SHAD
#define WREG_SHAD WREG_SHAD
extern volatile unsigned char           WREG_SHAD           __at(0xFE5);
#ifndef _LIB_BUILD
asm("WREG_SHAD equ 0FE5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned WREG_SHAD              :8;
    };
} WREG_SHADbits_t;
