MikroElektronika/core_packages/PIC/XC8/def/PIC12LF1612/mcu.h
/*
 * Bit Definitions
 */
#define _DEPRECATED __attribute__((__deprecated__))
#ifndef BANKMASK
#define BANKMASK(addr) ((addr)&07Fh)
#endif
#define _BIT_ACCESS(r,b) ___mkstr(BANKMASK(r)) "," ___mkstr(b)
#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr)&07FFh)
#endif
// CRCACCL<ACC0>
extern volatile __bit                   ACC0                __at(0x3C98);	// @ (0x793 * 8 + 0)
#define                                 ACC0_bit            _BIT_ACCESS(CRCACCL,0)
// CRCACCL<ACC1>
extern volatile __bit                   ACC1                __at(0x3C99);	// @ (0x793 * 8 + 1)
#define                                 ACC1_bit            _BIT_ACCESS(CRCACCL,1)
// CRCACCH<ACC10>
extern volatile __bit                   ACC10               __at(0x3CA2);	// @ (0x794 * 8 + 2)
#define                                 ACC10_bit           _BIT_ACCESS(CRCACCH,2)
// CRCACCH<ACC11>
extern volatile __bit                   ACC11               __at(0x3CA3);	// @ (0x794 * 8 + 3)
#define                                 ACC11_bit           _BIT_ACCESS(CRCACCH,3)
// CRCACCH<ACC12>
extern volatile __bit                   ACC12               __at(0x3CA4);	// @ (0x794 * 8 + 4)
#define                                 ACC12_bit           _BIT_ACCESS(CRCACCH,4)
// CRCACCH<ACC13>
extern volatile __bit                   ACC13               __at(0x3CA5);	// @ (0x794 * 8 + 5)
#define                                 ACC13_bit           _BIT_ACCESS(CRCACCH,5)
// CRCACCH<ACC14>
extern volatile __bit                   ACC14               __at(0x3CA6);	// @ (0x794 * 8 + 6)
#define                                 ACC14_bit           _BIT_ACCESS(CRCACCH,6)
// CRCACCH<ACC15>
extern volatile __bit                   ACC15               __at(0x3CA7);	// @ (0x794 * 8 + 7)
#define                                 ACC15_bit           _BIT_ACCESS(CRCACCH,7)
// CRCACCL<ACC2>
extern volatile __bit                   ACC2                __at(0x3C9A);	// @ (0x793 * 8 + 2)
#define                                 ACC2_bit            _BIT_ACCESS(CRCACCL,2)
// CRCACCL<ACC3>
extern volatile __bit                   ACC3                __at(0x3C9B);	// @ (0x793 * 8 + 3)
#define                                 ACC3_bit            _BIT_ACCESS(CRCACCL,3)
// CRCACCL<ACC4>
extern volatile __bit                   ACC4                __at(0x3C9C);	// @ (0x793 * 8 + 4)
#define                                 ACC4_bit            _BIT_ACCESS(CRCACCL,4)
// CRCACCL<ACC5>
extern volatile __bit                   ACC5                __at(0x3C9D);	// @ (0x793 * 8 + 5)
#define                                 ACC5_bit            _BIT_ACCESS(CRCACCL,5)
// CRCACCL<ACC6>
extern volatile __bit                   ACC6                __at(0x3C9E);	// @ (0x793 * 8 + 6)
#define                                 ACC6_bit            _BIT_ACCESS(CRCACCL,6)
// CRCACCL<ACC7>
extern volatile __bit                   ACC7                __at(0x3C9F);	// @ (0x793 * 8 + 7)
#define                                 ACC7_bit            _BIT_ACCESS(CRCACCL,7)
// CRCACCH<ACC8>
extern volatile __bit                   ACC8                __at(0x3CA0);	// @ (0x794 * 8 + 0)
#define                                 ACC8_bit            _BIT_ACCESS(CRCACCH,0)
// CRCACCH<ACC9>
extern volatile __bit                   ACC9                __at(0x3CA1);	// @ (0x794 * 8 + 1)
#define                                 ACC9_bit            _BIT_ACCESS(CRCACCH,1)
// CRCCON0<ACCM>
extern volatile __bit                   ACCM                __at(0x3CCC);	// @ (0x799 * 8 + 4)
#define                                 ACCM_bit            _BIT_ACCESS(CRCCON0,4)
// ADCON1<ADCS0>
extern volatile __bit                   ADCS0               __at(0x4F4);	// @ (0x9E * 8 + 4)
#define                                 ADCS0_bit           _BIT_ACCESS(ADCON1,4)
// ADCON1<ADCS1>
extern volatile __bit                   ADCS1               __at(0x4F5);	// @ (0x9E * 8 + 5)
#define                                 ADCS1_bit           _BIT_ACCESS(ADCON1,5)
// ADCON1<ADCS2>
extern volatile __bit                   ADCS2               __at(0x4F6);	// @ (0x9E * 8 + 6)
#define                                 ADCS2_bit           _BIT_ACCESS(ADCON1,6)
// ADCON1<ADFM>
extern volatile __bit                   ADFM                __at(0x4F7);	// @ (0x9E * 8 + 7)
#define                                 ADFM_bit            _BIT_ACCESS(ADCON1,7)
// FVRCON<ADFVR0>
extern volatile __bit                   ADFVR0              __at(0x8B8);	// @ (0x117 * 8 + 0)
#define                                 ADFVR0_bit          _BIT_ACCESS(FVRCON,0)
// FVRCON<ADFVR1>
extern volatile __bit                   ADFVR1              __at(0x8B9);	// @ (0x117 * 8 + 1)
#define                                 ADFVR1_bit          _BIT_ACCESS(FVRCON,1)
// ADCON0<ADGO>
extern volatile __bit                   ADGO                __at(0x4E9);	// @ (0x9D * 8 + 1)
#define                                 ADGO_bit            _BIT_ACCESS(ADCON0,1)
// PIE1<ADIE>
extern volatile __bit                   ADIE                __at(0x48E);	// @ (0x91 * 8 + 6)
#define                                 ADIE_bit            _BIT_ACCESS(PIE1,6)
// PIR1<ADIF>
extern volatile __bit                   ADIF                __at(0x8E);	// @ (0x11 * 8 + 6)
#define                                 ADIF_bit            _BIT_ACCESS(PIR1,6)
// ADCON0<ADON>
extern volatile __bit                   ADON                __at(0x4E8);	// @ (0x9D * 8 + 0)
#define                                 ADON_bit            _BIT_ACCESS(ADCON0,0)
// ADCON1<ADPREF0>
extern volatile __bit                   ADPREF0             __at(0x4F0);	// @ (0x9E * 8 + 0)
#define                                 ADPREF0_bit         _BIT_ACCESS(ADCON1,0)
// ADCON1<ADPREF1>
extern volatile __bit                   ADPREF1             __at(0x4F1);	// @ (0x9E * 8 + 1)
#define                                 ADPREF1_bit         _BIT_ACCESS(ADCON1,1)
// ANSELA<ANSA0>
extern volatile __bit                   ANSA0               __at(0xC60);	// @ (0x18C * 8 + 0)
#define                                 ANSA0_bit           _BIT_ACCESS(ANSELA,0)
// ANSELA<ANSA1>
extern volatile __bit                   ANSA1               __at(0xC61);	// @ (0x18C * 8 + 1)
#define                                 ANSA1_bit           _BIT_ACCESS(ANSELA,1)
// ANSELA<ANSA2>
extern volatile __bit                   ANSA2               __at(0xC62);	// @ (0x18C * 8 + 2)
#define                                 ANSA2_bit           _BIT_ACCESS(ANSELA,2)
// ANSELA<ANSA4>
extern volatile __bit                   ANSA4               __at(0xC64);	// @ (0x18C * 8 + 4)
#define                                 ANSA4_bit           _BIT_ACCESS(ANSELA,4)
// BORCON<BORFS>
extern volatile __bit                   BORFS               __at(0x8B6);	// @ (0x116 * 8 + 6)
#define                                 BORFS_bit           _BIT_ACCESS(BORCON,6)
// BORCON<BORRDY>
extern volatile __bit                   BORRDY              __at(0x8B0);	// @ (0x116 * 8 + 0)
#define                                 BORRDY_bit          _BIT_ACCESS(BORCON,0)
// BSR<BSR0>
extern volatile __bit                   BSR0                __at(0x40);	// @ (0x8 * 8 + 0)
#define                                 BSR0_bit            _BIT_ACCESS(BSR,0)
// BSR<BSR1>
extern volatile __bit                   BSR1                __at(0x41);	// @ (0x8 * 8 + 1)
#define                                 BSR1_bit            _BIT_ACCESS(BSR,1)
// BSR<BSR2>
extern volatile __bit                   BSR2                __at(0x42);	// @ (0x8 * 8 + 2)
#define                                 BSR2_bit            _BIT_ACCESS(BSR,2)
// BSR<BSR3>
extern volatile __bit                   BSR3                __at(0x43);	// @ (0x8 * 8 + 3)
#define                                 BSR3_bit            _BIT_ACCESS(BSR,3)
// BSR<BSR4>
extern volatile __bit                   BSR4                __at(0x44);	// @ (0x8 * 8 + 4)
#define                                 BSR4_bit            _BIT_ACCESS(BSR,4)
// CWG1AS1<C1AS>
extern volatile __bit                   C1AS                __at(0x34A1);	// @ (0x694 * 8 + 1)
#define                                 C1AS_bit            _BIT_ACCESS(CWG1AS1,1)
// CM1CON0<C1HYS>
extern volatile __bit                   C1HYS               __at(0x889);	// @ (0x111 * 8 + 1)
#define                                 C1HYS_bit           _BIT_ACCESS(CM1CON0,1)
// PIE2<C1IE>
extern volatile __bit                   C1IE                __at(0x495);	// @ (0x92 * 8 + 5)
#define                                 C1IE_bit            _BIT_ACCESS(PIE2,5)
// PIR2<C1IF>
extern volatile __bit                   C1IF                __at(0x95);	// @ (0x12 * 8 + 5)
#define                                 C1IF_bit            _BIT_ACCESS(PIR2,5)
// CM1CON1<C1INTN>
extern volatile __bit                   C1INTN              __at(0x896);	// @ (0x112 * 8 + 6)
#define                                 C1INTN_bit          _BIT_ACCESS(CM1CON1,6)
// CM1CON1<C1INTP>
extern volatile __bit                   C1INTP              __at(0x897);	// @ (0x112 * 8 + 7)
#define                                 C1INTP_bit          _BIT_ACCESS(CM1CON1,7)
// CM1CON1<C1NCH0>
extern volatile __bit                   C1NCH0              __at(0x890);	// @ (0x112 * 8 + 0)
#define                                 C1NCH0_bit          _BIT_ACCESS(CM1CON1,0)
// CM1CON1<C1NCH1>
extern volatile __bit                   C1NCH1              __at(0x891);	// @ (0x112 * 8 + 1)
#define                                 C1NCH1_bit          _BIT_ACCESS(CM1CON1,1)
// CM1CON1<C1NCH2>
extern volatile __bit                   C1NCH2              __at(0x892);	// @ (0x112 * 8 + 2)
#define                                 C1NCH2_bit          _BIT_ACCESS(CM1CON1,2)
// CM1CON0<C1OE>
extern volatile __bit                   C1OE                __at(0x88D);	// @ (0x111 * 8 + 5)
#define                                 C1OE_bit            _BIT_ACCESS(CM1CON0,5)
// CM1CON0<C1ON>
extern volatile __bit                   C1ON                __at(0x88F);	// @ (0x111 * 8 + 7)
#define                                 C1ON_bit            _BIT_ACCESS(CM1CON0,7)
// CM1CON0<C1OUT>
extern volatile __bit                   C1OUT               __at(0x88E);	// @ (0x111 * 8 + 6)
#define                                 C1OUT_bit           _BIT_ACCESS(CM1CON0,6)
// CM1CON1<C1PCH0>
extern volatile __bit                   C1PCH0              __at(0x894);	// @ (0x112 * 8 + 4)
#define                                 C1PCH0_bit          _BIT_ACCESS(CM1CON1,4)
// CM1CON1<C1PCH1>
extern volatile __bit                   C1PCH1              __at(0x895);	// @ (0x112 * 8 + 5)
#define                                 C1PCH1_bit          _BIT_ACCESS(CM1CON1,5)
// CM1CON0<C1POL>
extern volatile __bit                   C1POL               __at(0x88C);	// @ (0x111 * 8 + 4)
#define                                 C1POL_bit           _BIT_ACCESS(CM1CON0,4)
// CM1CON0<C1SP>
extern volatile __bit                   C1SP                __at(0x88A);	// @ (0x111 * 8 + 2)
#define                                 C1SP_bit            _BIT_ACCESS(CM1CON0,2)
// CM1CON0<C1SYNC>
extern volatile __bit                   C1SYNC              __at(0x888);	// @ (0x111 * 8 + 0)
#define                                 C1SYNC_bit          _BIT_ACCESS(CM1CON0,0)
// CWG1AS1<C2AS>
extern volatile __bit                   C2AS                __at(0x34A2);	// @ (0x694 * 8 + 2)
#define                                 C2AS_bit            _BIT_ACCESS(CWG1AS1,2)
// PIE2<C2IE>
extern volatile __bit                   C2IE                __at(0x496);	// @ (0x92 * 8 + 6)
#define                                 C2IE_bit            _BIT_ACCESS(PIE2,6)
// PIR2<C2IF>
extern volatile __bit                   C2IF                __at(0x96);	// @ (0x12 * 8 + 6)
#define                                 C2IF_bit            _BIT_ACCESS(PIR2,6)
// STATUS<CARRY>
extern volatile __bit                   CARRY               __at(0x18);	// @ (0x3 * 8 + 0)
#define                                 CARRY_bit           _BIT_ACCESS(STATUS,0)
// CCP1CAP<CCP1CTS0>
extern volatile __bit                   CCP1CTS0            __at(0x14A0);	// @ (0x294 * 8 + 0)
#define                                 CCP1CTS0_bit        _BIT_ACCESS(CCP1CAP,0)
// CCP1CAP<CCP1CTS1>
extern volatile __bit                   CCP1CTS1            __at(0x14A1);	// @ (0x294 * 8 + 1)
#define                                 CCP1CTS1_bit        _BIT_ACCESS(CCP1CAP,1)
// CCP1CON<CCP1EN>
extern volatile __bit                   CCP1EN              __at(0x149F);	// @ (0x293 * 8 + 7)
#define                                 CCP1EN_bit          _BIT_ACCESS(CCP1CON,7)
// CCP1CON<CCP1FMT>
extern volatile __bit                   CCP1FMT             __at(0x149C);	// @ (0x293 * 8 + 4)
#define                                 CCP1FMT_bit         _BIT_ACCESS(CCP1CON,4)
// PIE1<CCP1IE>
extern volatile __bit                   CCP1IE              __at(0x48A);	// @ (0x91 * 8 + 2)
#define                                 CCP1IE_bit          _BIT_ACCESS(PIE1,2)
// PIR1<CCP1IF>
extern volatile __bit                   CCP1IF              __at(0x8A);	// @ (0x11 * 8 + 2)
#define                                 CCP1IF_bit          _BIT_ACCESS(PIR1,2)
// CCP1CON<CCP1MODE0>
extern volatile __bit                   CCP1MODE0           __at(0x1498);	// @ (0x293 * 8 + 0)
#define                                 CCP1MODE0_bit       _BIT_ACCESS(CCP1CON,0)
// CCP1CON<CCP1MODE1>
extern volatile __bit                   CCP1MODE1           __at(0x1499);	// @ (0x293 * 8 + 1)
#define                                 CCP1MODE1_bit       _BIT_ACCESS(CCP1CON,1)
// CCP1CON<CCP1MODE2>
extern volatile __bit                   CCP1MODE2           __at(0x149A);	// @ (0x293 * 8 + 2)
#define                                 CCP1MODE2_bit       _BIT_ACCESS(CCP1CON,2)
// CCP1CON<CCP1MODE3>
extern volatile __bit                   CCP1MODE3           __at(0x149B);	// @ (0x293 * 8 + 3)
#define                                 CCP1MODE3_bit       _BIT_ACCESS(CCP1CON,3)
// CCP1CON<CCP1OE>
extern volatile __bit                   CCP1OE              __at(0x149E);	// @ (0x293 * 8 + 6)
#define                                 CCP1OE_bit          _BIT_ACCESS(CCP1CON,6)
// CCP1CON<CCP1OUT>
extern volatile __bit                   CCP1OUT             __at(0x149D);	// @ (0x293 * 8 + 5)
#define                                 CCP1OUT_bit         _BIT_ACCESS(CCP1CON,5)
// APFCON<CCP1SEL>
extern volatile __bit                   CCP1SEL             __at(0x8E8);	// @ (0x11D * 8 + 0)
#define                                 CCP1SEL_bit         _BIT_ACCESS(APFCON,0)
// CCPTMRS<CCP1TSEL0>
extern volatile __bit                   CCP1TSEL0           __at(0x14F0);	// @ (0x29E * 8 + 0)
#define                                 CCP1TSEL0_bit       _BIT_ACCESS(CCPTMRS,0)
// CCPTMRS<CCP1TSEL1>
extern volatile __bit                   CCP1TSEL1           __at(0x14F1);	// @ (0x29E * 8 + 1)
#define                                 CCP1TSEL1_bit       _BIT_ACCESS(CCPTMRS,1)
// CCP2CAP<CCP2CTS0>
extern volatile __bit                   CCP2CTS0            __at(0x14D8);	// @ (0x29B * 8 + 0)
#define                                 CCP2CTS0_bit        _BIT_ACCESS(CCP2CAP,0)
// CCP2CAP<CCP2CTS1>
extern volatile __bit                   CCP2CTS1            __at(0x14D9);	// @ (0x29B * 8 + 1)
#define                                 CCP2CTS1_bit        _BIT_ACCESS(CCP2CAP,1)
// CCP2CON<CCP2EN>
extern volatile __bit                   CCP2EN              __at(0x14D7);	// @ (0x29A * 8 + 7)
#define                                 CCP2EN_bit          _BIT_ACCESS(CCP2CON,7)
// CCP2CON<CCP2FMT>
extern volatile __bit                   CCP2FMT             __at(0x14D4);	// @ (0x29A * 8 + 4)
#define                                 CCP2FMT_bit         _BIT_ACCESS(CCP2CON,4)
// PIE2<CCP2IE>
extern volatile __bit                   CCP2IE              __at(0x490);	// @ (0x92 * 8 + 0)
#define                                 CCP2IE_bit          _BIT_ACCESS(PIE2,0)
// PIR2<CCP2IF>
extern volatile __bit                   CCP2IF              __at(0x90);	// @ (0x12 * 8 + 0)
#define                                 CCP2IF_bit          _BIT_ACCESS(PIR2,0)
// CCP2CON<CCP2MODE0>
extern volatile __bit                   CCP2MODE0           __at(0x14D0);	// @ (0x29A * 8 + 0)
#define                                 CCP2MODE0_bit       _BIT_ACCESS(CCP2CON,0)
// CCP2CON<CCP2MODE1>
extern volatile __bit                   CCP2MODE1           __at(0x14D1);	// @ (0x29A * 8 + 1)
#define                                 CCP2MODE1_bit       _BIT_ACCESS(CCP2CON,1)
// CCP2CON<CCP2MODE2>
extern volatile __bit                   CCP2MODE2           __at(0x14D2);	// @ (0x29A * 8 + 2)
#define                                 CCP2MODE2_bit       _BIT_ACCESS(CCP2CON,2)
// CCP2CON<CCP2MODE3>
extern volatile __bit                   CCP2MODE3           __at(0x14D3);	// @ (0x29A * 8 + 3)
#define                                 CCP2MODE3_bit       _BIT_ACCESS(CCP2CON,3)
// CCP2CON<CCP2OE>
extern volatile __bit                   CCP2OE              __at(0x14D6);	// @ (0x29A * 8 + 6)
#define                                 CCP2OE_bit          _BIT_ACCESS(CCP2CON,6)
// CCP2CON<CCP2OUT>
extern volatile __bit                   CCP2OUT             __at(0x14D5);	// @ (0x29A * 8 + 5)
#define                                 CCP2OUT_bit         _BIT_ACCESS(CCP2CON,5)
// CCPTMRS<CCP2TSEL0>
extern volatile __bit                   CCP2TSEL0           __at(0x14F2);	// @ (0x29E * 8 + 2)
#define                                 CCP2TSEL0_bit       _BIT_ACCESS(CCPTMRS,2)
// CCPTMRS<CCP2TSEL1>
extern volatile __bit                   CCP2TSEL1           __at(0x14F3);	// @ (0x29E * 8 + 3)
#define                                 CCP2TSEL1_bit       _BIT_ACCESS(CCPTMRS,3)
// FVRCON<CDAFVR0>
extern volatile __bit                   CDAFVR0             __at(0x8BA);	// @ (0x117 * 8 + 2)
#define                                 CDAFVR0_bit         _BIT_ACCESS(FVRCON,2)
// FVRCON<CDAFVR1>
extern volatile __bit                   CDAFVR1             __at(0x8BB);	// @ (0x117 * 8 + 3)
#define                                 CDAFVR1_bit         _BIT_ACCESS(FVRCON,3)
// PMCON1<CFGS>
extern volatile __bit                   CFGS                __at(0xCAE);	// @ (0x195 * 8 + 6)
#define                                 CFGS_bit            _BIT_ACCESS(PMCON1,6)
// ADCON0<CHS0>
extern volatile __bit                   CHS0                __at(0x4EA);	// @ (0x9D * 8 + 2)
#define                                 CHS0_bit            _BIT_ACCESS(ADCON0,2)
// ADCON0<CHS1>
extern volatile __bit                   CHS1                __at(0x4EB);	// @ (0x9D * 8 + 3)
#define                                 CHS1_bit            _BIT_ACCESS(ADCON0,3)
// ADCON0<CHS2>
extern volatile __bit                   CHS2                __at(0x4EC);	// @ (0x9D * 8 + 4)
#define                                 CHS2_bit            _BIT_ACCESS(ADCON0,4)
// ADCON0<CHS3>
extern volatile __bit                   CHS3                __at(0x4ED);	// @ (0x9D * 8 + 5)
#define                                 CHS3_bit            _BIT_ACCESS(ADCON0,5)
// ADCON0<CHS4>
extern volatile __bit                   CHS4                __at(0x4EE);	// @ (0x9D * 8 + 6)
#define                                 CHS4_bit            _BIT_ACCESS(ADCON0,6)
// CRCACCL<CRCACC0>
extern volatile __bit                   CRCACC0             __at(0x3C98);	// @ (0x793 * 8 + 0)
#define                                 CRCACC0_bit         _BIT_ACCESS(CRCACCL,0)
// CRCACCL<CRCACC1>
extern volatile __bit                   CRCACC1             __at(0x3C99);	// @ (0x793 * 8 + 1)
#define                                 CRCACC1_bit         _BIT_ACCESS(CRCACCL,1)
// CRCACCH<CRCACC10>
extern volatile __bit                   CRCACC10            __at(0x3CA2);	// @ (0x794 * 8 + 2)
#define                                 CRCACC10_bit        _BIT_ACCESS(CRCACCH,2)
// CRCACCH<CRCACC11>
extern volatile __bit                   CRCACC11            __at(0x3CA3);	// @ (0x794 * 8 + 3)
#define                                 CRCACC11_bit        _BIT_ACCESS(CRCACCH,3)
// CRCACCH<CRCACC12>
extern volatile __bit                   CRCACC12            __at(0x3CA4);	// @ (0x794 * 8 + 4)
#define                                 CRCACC12_bit        _BIT_ACCESS(CRCACCH,4)
// CRCACCH<CRCACC13>
extern volatile __bit                   CRCACC13            __at(0x3CA5);	// @ (0x794 * 8 + 5)
#define                                 CRCACC13_bit        _BIT_ACCESS(CRCACCH,5)
// CRCACCH<CRCACC14>
extern volatile __bit                   CRCACC14            __at(0x3CA6);	// @ (0x794 * 8 + 6)
#define                                 CRCACC14_bit        _BIT_ACCESS(CRCACCH,6)
// CRCACCH<CRCACC15>
extern volatile __bit                   CRCACC15            __at(0x3CA7);	// @ (0x794 * 8 + 7)
#define                                 CRCACC15_bit        _BIT_ACCESS(CRCACCH,7)
// CRCACCL<CRCACC2>
extern volatile __bit                   CRCACC2             __at(0x3C9A);	// @ (0x793 * 8 + 2)
#define                                 CRCACC2_bit         _BIT_ACCESS(CRCACCL,2)
// CRCACCL<CRCACC3>
extern volatile __bit                   CRCACC3             __at(0x3C9B);	// @ (0x793 * 8 + 3)
#define                                 CRCACC3_bit         _BIT_ACCESS(CRCACCL,3)
// CRCACCL<CRCACC4>
extern volatile __bit                   CRCACC4             __at(0x3C9C);	// @ (0x793 * 8 + 4)
#define                                 CRCACC4_bit         _BIT_ACCESS(CRCACCL,4)
// CRCACCL<CRCACC5>
extern volatile __bit                   CRCACC5             __at(0x3C9D);	// @ (0x793 * 8 + 5)
#define                                 CRCACC5_bit         _BIT_ACCESS(CRCACCL,5)
// CRCACCL<CRCACC6>
extern volatile __bit                   CRCACC6             __at(0x3C9E);	// @ (0x793 * 8 + 6)
#define                                 CRCACC6_bit         _BIT_ACCESS(CRCACCL,6)
// CRCACCL<CRCACC7>
extern volatile __bit                   CRCACC7             __at(0x3C9F);	// @ (0x793 * 8 + 7)
#define                                 CRCACC7_bit         _BIT_ACCESS(CRCACCL,7)
// CRCACCH<CRCACC8>
extern volatile __bit                   CRCACC8             __at(0x3CA0);	// @ (0x794 * 8 + 0)
#define                                 CRCACC8_bit         _BIT_ACCESS(CRCACCH,0)
// CRCACCH<CRCACC9>
extern volatile __bit                   CRCACC9             __at(0x3CA1);	// @ (0x794 * 8 + 1)
#define                                 CRCACC9_bit         _BIT_ACCESS(CRCACCH,1)
// CRCCON0<CRCACCM>
extern volatile __bit                   CRCACCM             __at(0x3CCC);	// @ (0x799 * 8 + 4)
#define                                 CRCACCM_bit         _BIT_ACCESS(CRCCON0,4)
// CRCCON0<CRCBUSY>
extern volatile __bit                   CRCBUSY             __at(0x3CCD);	// @ (0x799 * 8 + 5)
#define                                 CRCBUSY_bit         _BIT_ACCESS(CRCCON0,5)
// CRCDATL<CRCDAT0>
extern volatile __bit                   CRCDAT0             __at(0x3C88);	// @ (0x791 * 8 + 0)
#define                                 CRCDAT0_bit         _BIT_ACCESS(CRCDATL,0)
// CRCDATL<CRCDAT1>
extern volatile __bit                   CRCDAT1             __at(0x3C89);	// @ (0x791 * 8 + 1)
#define                                 CRCDAT1_bit         _BIT_ACCESS(CRCDATL,1)
// CRCDATH<CRCDAT10>
extern volatile __bit                   CRCDAT10            __at(0x3C92);	// @ (0x792 * 8 + 2)
#define                                 CRCDAT10_bit        _BIT_ACCESS(CRCDATH,2)
// CRCDATH<CRCDAT11>
extern volatile __bit                   CRCDAT11            __at(0x3C93);	// @ (0x792 * 8 + 3)
#define                                 CRCDAT11_bit        _BIT_ACCESS(CRCDATH,3)
// CRCDATH<CRCDAT12>
extern volatile __bit                   CRCDAT12            __at(0x3C94);	// @ (0x792 * 8 + 4)
#define                                 CRCDAT12_bit        _BIT_ACCESS(CRCDATH,4)
// CRCDATH<CRCDAT13>
extern volatile __bit                   CRCDAT13            __at(0x3C95);	// @ (0x792 * 8 + 5)
