MikroElektronika/core_packages/PIC/XC8/def/PIC12LF1612/mcu.h
// SMT2STAT<SMT2RESET>
extern volatile __bit                   SMT2RESET           __at(0x6D65);	// @ (0xDAC * 8 + 5)
#define                                 SMT2RESET_bit       _BIT_ACCESS(SMT2STAT,5)
// SMT2SIG<SMT2SSEL0>
extern volatile __bit                   SMT2SSEL0           __at(0x6D70);	// @ (0xDAE * 8 + 0)
#define                                 SMT2SSEL0_bit       _BIT_ACCESS(SMT2SIG,0)
// SMT2SIG<SMT2SSEL1>
extern volatile __bit                   SMT2SSEL1           __at(0x6D71);	// @ (0xDAE * 8 + 1)
#define                                 SMT2SSEL1_bit       _BIT_ACCESS(SMT2SIG,1)
// SMT2SIG<SMT2SSEL2>
extern volatile __bit                   SMT2SSEL2           __at(0x6D72);	// @ (0xDAE * 8 + 2)
#define                                 SMT2SSEL2_bit       _BIT_ACCESS(SMT2SIG,2)
// SMT2SIG<SMT2SSEL3>
extern volatile __bit                   SMT2SSEL3           __at(0x6D73);	// @ (0xDAE * 8 + 3)
#define                                 SMT2SSEL3_bit       _BIT_ACCESS(SMT2SIG,3)
// SMT2SIG<SMT2SSEL4>
extern volatile __bit                   SMT2SSEL4           __at(0x6D74);	// @ (0xDAE * 8 + 4)
#define                                 SMT2SSEL4_bit       _BIT_ACCESS(SMT2SIG,4)
// SMT2SIG<SMT2SSEL5>
extern volatile __bit                   SMT2SSEL5           __at(0x6D75);	// @ (0xDAE * 8 + 5)
#define                                 SMT2SSEL5_bit       _BIT_ACCESS(SMT2SIG,5)
// SMT2SIG<SMT2SSEL6>
extern volatile __bit                   SMT2SSEL6           __at(0x6D76);	// @ (0xDAE * 8 + 6)
#define                                 SMT2SSEL6_bit       _BIT_ACCESS(SMT2SIG,6)
// SMT2SIG<SMT2SSEL7>
extern volatile __bit                   SMT2SSEL7           __at(0x6D77);	// @ (0xDAE * 8 + 7)
#define                                 SMT2SSEL7_bit       _BIT_ACCESS(SMT2SIG,7)
// SMT2TMRL<SMT2TMR0>
extern volatile __bit                   SMT2TMR0            __at(0x6CF0);	// @ (0xD9E * 8 + 0)
#define                                 SMT2TMR0_bit        _BIT_ACCESS(SMT2TMRL,0)
// SMT2TMRL<SMT2TMR1>
extern volatile __bit                   SMT2TMR1            __at(0x6CF1);	// @ (0xD9E * 8 + 1)
#define                                 SMT2TMR1_bit        _BIT_ACCESS(SMT2TMRL,1)
// SMT2TMRH<SMT2TMR10>
extern volatile __bit                   SMT2TMR10           __at(0x6CFA);	// @ (0xD9F * 8 + 2)
#define                                 SMT2TMR10_bit       _BIT_ACCESS(SMT2TMRH,2)
// SMT2TMRH<SMT2TMR11>
extern volatile __bit                   SMT2TMR11           __at(0x6CFB);	// @ (0xD9F * 8 + 3)
#define                                 SMT2TMR11_bit       _BIT_ACCESS(SMT2TMRH,3)
// SMT2TMRH<SMT2TMR12>
extern volatile __bit                   SMT2TMR12           __at(0x6CFC);	// @ (0xD9F * 8 + 4)
#define                                 SMT2TMR12_bit       _BIT_ACCESS(SMT2TMRH,4)
// SMT2TMRH<SMT2TMR13>
extern volatile __bit                   SMT2TMR13           __at(0x6CFD);	// @ (0xD9F * 8 + 5)
#define                                 SMT2TMR13_bit       _BIT_ACCESS(SMT2TMRH,5)
// SMT2TMRH<SMT2TMR14>
extern volatile __bit                   SMT2TMR14           __at(0x6CFE);	// @ (0xD9F * 8 + 6)
#define                                 SMT2TMR14_bit       _BIT_ACCESS(SMT2TMRH,6)
// SMT2TMRH<SMT2TMR15>
extern volatile __bit                   SMT2TMR15           __at(0x6CFF);	// @ (0xD9F * 8 + 7)
#define                                 SMT2TMR15_bit       _BIT_ACCESS(SMT2TMRH,7)
// SMT2TMRU<SMT2TMR16>
extern volatile __bit                   SMT2TMR16           __at(0x6D00);	// @ (0xDA0 * 8 + 0)
#define                                 SMT2TMR16_bit       _BIT_ACCESS(SMT2TMRU,0)
// SMT2TMRU<SMT2TMR17>
extern volatile __bit                   SMT2TMR17           __at(0x6D01);	// @ (0xDA0 * 8 + 1)
#define                                 SMT2TMR17_bit       _BIT_ACCESS(SMT2TMRU,1)
// SMT2TMRU<SMT2TMR18>
extern volatile __bit                   SMT2TMR18           __at(0x6D02);	// @ (0xDA0 * 8 + 2)
#define                                 SMT2TMR18_bit       _BIT_ACCESS(SMT2TMRU,2)
// SMT2TMRU<SMT2TMR19>
extern volatile __bit                   SMT2TMR19           __at(0x6D03);	// @ (0xDA0 * 8 + 3)
#define                                 SMT2TMR19_bit       _BIT_ACCESS(SMT2TMRU,3)
// SMT2TMRL<SMT2TMR2>
extern volatile __bit                   SMT2TMR2            __at(0x6CF2);	// @ (0xD9E * 8 + 2)
#define                                 SMT2TMR2_bit        _BIT_ACCESS(SMT2TMRL,2)
// SMT2TMRU<SMT2TMR20>
extern volatile __bit                   SMT2TMR20           __at(0x6D04);	// @ (0xDA0 * 8 + 4)
#define                                 SMT2TMR20_bit       _BIT_ACCESS(SMT2TMRU,4)
// SMT2TMRU<SMT2TMR21>
extern volatile __bit                   SMT2TMR21           __at(0x6D05);	// @ (0xDA0 * 8 + 5)
#define                                 SMT2TMR21_bit       _BIT_ACCESS(SMT2TMRU,5)
// SMT2TMRU<SMT2TMR22>
extern volatile __bit                   SMT2TMR22           __at(0x6D06);	// @ (0xDA0 * 8 + 6)
#define                                 SMT2TMR22_bit       _BIT_ACCESS(SMT2TMRU,6)
// SMT2TMRU<SMT2TMR23>
extern volatile __bit                   SMT2TMR23           __at(0x6D07);	// @ (0xDA0 * 8 + 7)
#define                                 SMT2TMR23_bit       _BIT_ACCESS(SMT2TMRU,7)
// SMT2TMRL<SMT2TMR3>
extern volatile __bit                   SMT2TMR3            __at(0x6CF3);	// @ (0xD9E * 8 + 3)
#define                                 SMT2TMR3_bit        _BIT_ACCESS(SMT2TMRL,3)
// SMT2TMRL<SMT2TMR4>
extern volatile __bit                   SMT2TMR4            __at(0x6CF4);	// @ (0xD9E * 8 + 4)
#define                                 SMT2TMR4_bit        _BIT_ACCESS(SMT2TMRL,4)
// SMT2TMRL<SMT2TMR5>
extern volatile __bit                   SMT2TMR5            __at(0x6CF5);	// @ (0xD9E * 8 + 5)
#define                                 SMT2TMR5_bit        _BIT_ACCESS(SMT2TMRL,5)
// SMT2TMRL<SMT2TMR6>
extern volatile __bit                   SMT2TMR6            __at(0x6CF6);	// @ (0xD9E * 8 + 6)
#define                                 SMT2TMR6_bit        _BIT_ACCESS(SMT2TMRL,6)
// SMT2TMRL<SMT2TMR7>
extern volatile __bit                   SMT2TMR7            __at(0x6CF7);	// @ (0xD9E * 8 + 7)
#define                                 SMT2TMR7_bit        _BIT_ACCESS(SMT2TMRL,7)
// SMT2TMRH<SMT2TMR8>
extern volatile __bit                   SMT2TMR8            __at(0x6CF8);	// @ (0xD9F * 8 + 0)
#define                                 SMT2TMR8_bit        _BIT_ACCESS(SMT2TMRH,0)
// SMT2TMRH<SMT2TMR9>
extern volatile __bit                   SMT2TMR9            __at(0x6CF9);	// @ (0xD9F * 8 + 1)
#define                                 SMT2TMR9_bit        _BIT_ACCESS(SMT2TMRH,1)
// SMT2STAT<SMT2TS>
extern volatile __bit                   SMT2TS              __at(0x6D62);	// @ (0xDAC * 8 + 2)
#define                                 SMT2TS_bit          _BIT_ACCESS(SMT2STAT,2)
// SMT2STAT<SMT2WS>
extern volatile __bit                   SMT2WS              __at(0x6D61);	// @ (0xDAC * 8 + 1)
#define                                 SMT2WS_bit          _BIT_ACCESS(SMT2STAT,1)
// SMT2WIN<SMT2WSEL0>
extern volatile __bit                   SMT2WSEL0           __at(0x6D78);	// @ (0xDAF * 8 + 0)
#define                                 SMT2WSEL0_bit       _BIT_ACCESS(SMT2WIN,0)
// SMT2WIN<SMT2WSEL1>
extern volatile __bit                   SMT2WSEL1           __at(0x6D79);	// @ (0xDAF * 8 + 1)
#define                                 SMT2WSEL1_bit       _BIT_ACCESS(SMT2WIN,1)
// SMT2WIN<SMT2WSEL2>
extern volatile __bit                   SMT2WSEL2           __at(0x6D7A);	// @ (0xDAF * 8 + 2)
#define                                 SMT2WSEL2_bit       _BIT_ACCESS(SMT2WIN,2)
// SMT2WIN<SMT2WSEL3>
extern volatile __bit                   SMT2WSEL3           __at(0x6D7B);	// @ (0xDAF * 8 + 3)
#define                                 SMT2WSEL3_bit       _BIT_ACCESS(SMT2WIN,3)
// SMT2WIN<SMT2WSEL4>
extern volatile __bit                   SMT2WSEL4           __at(0x6D7C);	// @ (0xDAF * 8 + 4)
#define                                 SMT2WSEL4_bit       _BIT_ACCESS(SMT2WIN,4)
// SMT2WIN<SMT2WSEL5>
extern volatile __bit                   SMT2WSEL5           __at(0x6D7D);	// @ (0xDAF * 8 + 5)
#define                                 SMT2WSEL5_bit       _BIT_ACCESS(SMT2WIN,5)
// SMT2WIN<SMT2WSEL6>
extern volatile __bit                   SMT2WSEL6           __at(0x6D7E);	// @ (0xDAF * 8 + 6)
#define                                 SMT2WSEL6_bit       _BIT_ACCESS(SMT2WIN,6)
// SMT2WIN<SMT2WSEL7>
extern volatile __bit                   SMT2WSEL7           __at(0x6D7F);	// @ (0xDAF * 8 + 7)
#define                                 SMT2WSEL7_bit       _BIT_ACCESS(SMT2WIN,7)
// OSCCON<SPLLEN>
extern volatile __bit                   SPLLEN              __at(0x4CF);	// @ (0x99 * 8 + 7)
#define                                 SPLLEN_bit          _BIT_ACCESS(OSCCON,7)
// SMT2SIG<SSEL3>
extern volatile __bit                   SSEL3               __at(0x6D73);	// @ (0xDAE * 8 + 3)
#define                                 SSEL3_bit           _BIT_ACCESS(SMT2SIG,3)
// SMT2SIG<SSEL4>
extern volatile __bit                   SSEL4               __at(0x6D74);	// @ (0xDAE * 8 + 4)
#define                                 SSEL4_bit           _BIT_ACCESS(SMT2SIG,4)
// SMT2SIG<SSEL5>
extern volatile __bit                   SSEL5               __at(0x6D75);	// @ (0xDAE * 8 + 5)
#define                                 SSEL5_bit           _BIT_ACCESS(SMT2SIG,5)
// SMT2SIG<SSEL6>
extern volatile __bit                   SSEL6               __at(0x6D76);	// @ (0xDAE * 8 + 6)
#define                                 SSEL6_bit           _BIT_ACCESS(SMT2SIG,6)
// SMT2SIG<SSEL7>
extern volatile __bit                   SSEL7               __at(0x6D77);	// @ (0xDAE * 8 + 7)
#define                                 SSEL7_bit           _BIT_ACCESS(SMT2SIG,7)
// WDTTMR<STATE>
extern volatile __bit                   STATE               __at(0x38AA);	// @ (0x715 * 8 + 2)
#define                                 STATE_bit           _BIT_ACCESS(WDTTMR,2)
// PCON<STKOVF>
extern volatile __bit                   STKOVF              __at(0x4B7);	// @ (0x96 * 8 + 7)
#define                                 STKOVF_bit          _BIT_ACCESS(PCON,7)
// PCON<STKUNF>
extern volatile __bit                   STKUNF              __at(0x4B6);	// @ (0x96 * 8 + 6)
#define                                 STKUNF_bit          _BIT_ACCESS(PCON,6)
// CWG1OCON0<STRA>
extern volatile __bit                   STRA                __at(0x34A8);	// @ (0x695 * 8 + 0)
#define                                 STRA_bit            _BIT_ACCESS(CWG1OCON0,0)
// CWG1OCON0<STRB>
extern volatile __bit                   STRB                __at(0x34A9);	// @ (0x695 * 8 + 1)
#define                                 STRB_bit            _BIT_ACCESS(CWG1OCON0,1)
// CWG1OCON0<STRC>
extern volatile __bit                   STRC                __at(0x34AA);	// @ (0x695 * 8 + 2)
#define                                 STRC_bit            _BIT_ACCESS(CWG1OCON0,2)
// CWG1OCON0<STRD>
extern volatile __bit                   STRD                __at(0x34AB);	// @ (0x695 * 8 + 3)
#define                                 STRD_bit            _BIT_ACCESS(CWG1OCON0,3)
// WDTCON0<SWDTEN>
extern volatile __bit                   SWDTEN              __at(0x3888);	// @ (0x711 * 8 + 0)
#define                                 SWDTEN_bit          _BIT_ACCESS(WDTCON0,0)
// OPTION_REG<T0CS>
extern volatile __bit                   T0CS                __at(0x4AD);	// @ (0x95 * 8 + 5)
#define                                 T0CS_bit            _BIT_ACCESS(OPTION_REG,5)
// INTCON<T0IE>
extern volatile __bit                   T0IE                __at(0x5D);	// @ (0xB * 8 + 5)
#define                                 T0IE_bit            _BIT_ACCESS(INTCON,5)
// INTCON<T0IF>
extern volatile __bit                   T0IF                __at(0x5A);	// @ (0xB * 8 + 2)
#define                                 T0IF_bit            _BIT_ACCESS(INTCON,2)
// OPTION_REG<T0SE>
extern volatile __bit                   T0SE                __at(0x4AC);	// @ (0x95 * 8 + 4)
#define                                 T0SE_bit            _BIT_ACCESS(OPTION_REG,4)
// T1CON<T1CKPS0>
extern volatile __bit                   T1CKPS0             __at(0xC4);	// @ (0x18 * 8 + 4)
#define                                 T1CKPS0_bit         _BIT_ACCESS(T1CON,4)
// T1CON<T1CKPS1>
extern volatile __bit                   T1CKPS1             __at(0xC5);	// @ (0x18 * 8 + 5)
#define                                 T1CKPS1_bit         _BIT_ACCESS(T1CON,5)
// T1GCON<T1GGO_nDONE>
extern volatile __bit                   T1GGO_nDONE         __at(0xCB);	// @ (0x19 * 8 + 3)
#define                                 T1GGO_nDONE_bit     _BIT_ACCESS(T1GCON,3)
// T1GCON<T1GPOL>
extern volatile __bit                   T1GPOL              __at(0xCE);	// @ (0x19 * 8 + 6)
#define                                 T1GPOL_bit          _BIT_ACCESS(T1GCON,6)
// APFCON<T1GSEL>
extern volatile __bit                   T1GSEL              __at(0x8EB);	// @ (0x11D * 8 + 3)
#define                                 T1GSEL_bit          _BIT_ACCESS(APFCON,3)
// T1GCON<T1GSPM>
extern volatile __bit                   T1GSPM              __at(0xCC);	// @ (0x19 * 8 + 4)
#define                                 T1GSPM_bit          _BIT_ACCESS(T1GCON,4)
// T1GCON<T1GSS0>
extern volatile __bit                   T1GSS0              __at(0xC8);	// @ (0x19 * 8 + 0)
#define                                 T1GSS0_bit          _BIT_ACCESS(T1GCON,0)
// T1GCON<T1GSS1>
extern volatile __bit                   T1GSS1              __at(0xC9);	// @ (0x19 * 8 + 1)
#define                                 T1GSS1_bit          _BIT_ACCESS(T1GCON,1)
// T1GCON<T1GTM>
extern volatile __bit                   T1GTM               __at(0xCD);	// @ (0x19 * 8 + 5)
#define                                 T1GTM_bit           _BIT_ACCESS(T1GCON,5)
// T1GCON<T1GVAL>
extern volatile __bit                   T1GVAL              __at(0xCA);	// @ (0x19 * 8 + 2)
#define                                 T1GVAL_bit          _BIT_ACCESS(T1GCON,2)
// T2HLT<T2CKPOL>
extern volatile __bit                   T2CKPOL             __at(0xEE);	// @ (0x1D * 8 + 6)
#define                                 T2CKPOL_bit         _BIT_ACCESS(T2HLT,6)
// T2CON<T2CKPS0>
extern volatile __bit                   T2CKPS0             __at(0xE4);	// @ (0x1C * 8 + 4)
#define                                 T2CKPS0_bit         _BIT_ACCESS(T2CON,4)
// T2CON<T2CKPS1>
extern volatile __bit                   T2CKPS1             __at(0xE5);	// @ (0x1C * 8 + 5)
#define                                 T2CKPS1_bit         _BIT_ACCESS(T2CON,5)
// T2CON<T2CKPS2>
extern volatile __bit                   T2CKPS2             __at(0xE6);	// @ (0x1C * 8 + 6)
#define                                 T2CKPS2_bit         _BIT_ACCESS(T2CON,6)
// T2HLT<T2CKSYNC>
extern volatile __bit                   T2CKSYNC            __at(0xED);	// @ (0x1D * 8 + 5)
#define                                 T2CKSYNC_bit        _BIT_ACCESS(T2HLT,5)
// T2CLKCON<T2CS0>
extern volatile __bit                   T2CS0               __at(0xF0);	// @ (0x1E * 8 + 0)
#define                                 T2CS0_bit           _BIT_ACCESS(T2CLKCON,0)
// T2CLKCON<T2CS1>
extern volatile __bit                   T2CS1               __at(0xF1);	// @ (0x1E * 8 + 1)
#define                                 T2CS1_bit           _BIT_ACCESS(T2CLKCON,1)
// T2CLKCON<T2CS2>
extern volatile __bit                   T2CS2               __at(0xF2);	// @ (0x1E * 8 + 2)
#define                                 T2CS2_bit           _BIT_ACCESS(T2CLKCON,2)
// T2HLT<T2MODE0>
extern volatile __bit                   T2MODE0             __at(0xE8);	// @ (0x1D * 8 + 0)
#define                                 T2MODE0_bit         _BIT_ACCESS(T2HLT,0)
// T2HLT<T2MODE1>
extern volatile __bit                   T2MODE1             __at(0xE9);	// @ (0x1D * 8 + 1)
#define                                 T2MODE1_bit         _BIT_ACCESS(T2HLT,1)
// T2HLT<T2MODE2>
extern volatile __bit                   T2MODE2             __at(0xEA);	// @ (0x1D * 8 + 2)
#define                                 T2MODE2_bit         _BIT_ACCESS(T2HLT,2)
// T2HLT<T2MODE3>
extern volatile __bit                   T2MODE3             __at(0xEB);	// @ (0x1D * 8 + 3)
#define                                 T2MODE3_bit         _BIT_ACCESS(T2HLT,3)
// T2CON<T2ON>
extern volatile __bit                   T2ON                __at(0xE7);	// @ (0x1C * 8 + 7)
#define                                 T2ON_bit            _BIT_ACCESS(T2CON,7)
// T2CON<T2OUTPS0>
extern volatile __bit                   T2OUTPS0            __at(0xE0);	// @ (0x1C * 8 + 0)
#define                                 T2OUTPS0_bit        _BIT_ACCESS(T2CON,0)
// T2CON<T2OUTPS1>
extern volatile __bit                   T2OUTPS1            __at(0xE1);	// @ (0x1C * 8 + 1)
#define                                 T2OUTPS1_bit        _BIT_ACCESS(T2CON,1)
// T2CON<T2OUTPS2>
extern volatile __bit                   T2OUTPS2            __at(0xE2);	// @ (0x1C * 8 + 2)
#define                                 T2OUTPS2_bit        _BIT_ACCESS(T2CON,2)
// T2CON<T2OUTPS3>
extern volatile __bit                   T2OUTPS3            __at(0xE3);	// @ (0x1C * 8 + 3)
#define                                 T2OUTPS3_bit        _BIT_ACCESS(T2CON,3)
// T2HLT<T2PSYNC>
extern volatile __bit                   T2PSYNC             __at(0xEF);	// @ (0x1D * 8 + 7)
#define                                 T2PSYNC_bit         _BIT_ACCESS(T2HLT,7)
// T2RST<T2RSEL0>
extern volatile __bit                   T2RSEL0             __at(0xF8);	// @ (0x1F * 8 + 0)
#define                                 T2RSEL0_bit         _BIT_ACCESS(T2RST,0)
// T2RST<T2RSEL1>
extern volatile __bit                   T2RSEL1             __at(0xF9);	// @ (0x1F * 8 + 1)
#define                                 T2RSEL1_bit         _BIT_ACCESS(T2RST,1)
// T2RST<T2RSEL2>
extern volatile __bit                   T2RSEL2             __at(0xFA);	// @ (0x1F * 8 + 2)
#define                                 T2RSEL2_bit         _BIT_ACCESS(T2RST,2)
// T2RST<T2RSEL3>
extern volatile __bit                   T2RSEL3             __at(0xFB);	// @ (0x1F * 8 + 3)
#define                                 T2RSEL3_bit         _BIT_ACCESS(T2RST,3)
// T4HLT<T4CKPOL>
extern volatile __bit                   T4CKPOL             __at(0x20B6);	// @ (0x416 * 8 + 6)
#define                                 T4CKPOL_bit         _BIT_ACCESS(T4HLT,6)
// T4CON<T4CKPS0>
extern volatile __bit                   T4CKPS0             __at(0x20AC);	// @ (0x415 * 8 + 4)
#define                                 T4CKPS0_bit         _BIT_ACCESS(T4CON,4)
// T4CON<T4CKPS1>
extern volatile __bit                   T4CKPS1             __at(0x20AD);	// @ (0x415 * 8 + 5)
#define                                 T4CKPS1_bit         _BIT_ACCESS(T4CON,5)
// T4CON<T4CKPS2>
extern volatile __bit                   T4CKPS2             __at(0x20AE);	// @ (0x415 * 8 + 6)
#define                                 T4CKPS2_bit         _BIT_ACCESS(T4CON,6)
// T4HLT<T4CKSYNC>
extern volatile __bit                   T4CKSYNC            __at(0x20B5);	// @ (0x416 * 8 + 5)
#define                                 T4CKSYNC_bit        _BIT_ACCESS(T4HLT,5)
// T4CLKCON<T4CS0>
extern volatile __bit                   T4CS0               __at(0x20B8);	// @ (0x417 * 8 + 0)
#define                                 T4CS0_bit           _BIT_ACCESS(T4CLKCON,0)
// T4CLKCON<T4CS1>
extern volatile __bit                   T4CS1               __at(0x20B9);	// @ (0x417 * 8 + 1)
#define                                 T4CS1_bit           _BIT_ACCESS(T4CLKCON,1)
// T4CLKCON<T4CS2>
extern volatile __bit                   T4CS2               __at(0x20BA);	// @ (0x417 * 8 + 2)
#define                                 T4CS2_bit           _BIT_ACCESS(T4CLKCON,2)
// T4HLT<T4MODE0>
extern volatile __bit                   T4MODE0             __at(0x20B0);	// @ (0x416 * 8 + 0)
#define                                 T4MODE0_bit         _BIT_ACCESS(T4HLT,0)
// T4HLT<T4MODE1>
extern volatile __bit                   T4MODE1             __at(0x20B1);	// @ (0x416 * 8 + 1)
#define                                 T4MODE1_bit         _BIT_ACCESS(T4HLT,1)
// T4HLT<T4MODE2>
extern volatile __bit                   T4MODE2             __at(0x20B2);	// @ (0x416 * 8 + 2)
#define                                 T4MODE2_bit         _BIT_ACCESS(T4HLT,2)
// T4HLT<T4MODE3>
extern volatile __bit                   T4MODE3             __at(0x20B3);	// @ (0x416 * 8 + 3)
#define                                 T4MODE3_bit         _BIT_ACCESS(T4HLT,3)
// T4CON<T4ON>
extern volatile __bit                   T4ON                __at(0x20AF);	// @ (0x415 * 8 + 7)
#define                                 T4ON_bit            _BIT_ACCESS(T4CON,7)
// T4CON<T4OUTPS0>
extern volatile __bit                   T4OUTPS0            __at(0x20A8);	// @ (0x415 * 8 + 0)
#define                                 T4OUTPS0_bit        _BIT_ACCESS(T4CON,0)
// T4CON<T4OUTPS1>
extern volatile __bit                   T4OUTPS1            __at(0x20A9);	// @ (0x415 * 8 + 1)
#define                                 T4OUTPS1_bit        _BIT_ACCESS(T4CON,1)
// T4CON<T4OUTPS2>
extern volatile __bit                   T4OUTPS2            __at(0x20AA);	// @ (0x415 * 8 + 2)
#define                                 T4OUTPS2_bit        _BIT_ACCESS(T4CON,2)
// T4CON<T4OUTPS3>
extern volatile __bit                   T4OUTPS3            __at(0x20AB);	// @ (0x415 * 8 + 3)
#define                                 T4OUTPS3_bit        _BIT_ACCESS(T4CON,3)
// T4HLT<T4PSYNC>
extern volatile __bit                   T4PSYNC             __at(0x20B7);	// @ (0x416 * 8 + 7)
#define                                 T4PSYNC_bit         _BIT_ACCESS(T4HLT,7)
// T4RST<T4RSEL0>
extern volatile __bit                   T4RSEL0             __at(0x20C0);	// @ (0x418 * 8 + 0)
#define                                 T4RSEL0_bit         _BIT_ACCESS(T4RST,0)
// T4RST<T4RSEL1>
extern volatile __bit                   T4RSEL1             __at(0x20C1);	// @ (0x418 * 8 + 1)
#define                                 T4RSEL1_bit         _BIT_ACCESS(T4RST,1)
// T4RST<T4RSEL2>
extern volatile __bit                   T4RSEL2             __at(0x20C2);	// @ (0x418 * 8 + 2)
#define                                 T4RSEL2_bit         _BIT_ACCESS(T4RST,2)
// T4RST<T4RSEL3>
extern volatile __bit                   T4RSEL3             __at(0x20C3);	// @ (0x418 * 8 + 3)
#define                                 T4RSEL3_bit         _BIT_ACCESS(T4RST,3)
// T6HLT<T6CKPOL>
extern volatile __bit                   T6CKPOL             __at(0x20EE);	// @ (0x41D * 8 + 6)
#define                                 T6CKPOL_bit         _BIT_ACCESS(T6HLT,6)
// T6CON<T6CKPS0>
extern volatile __bit                   T6CKPS0             __at(0x20E4);	// @ (0x41C * 8 + 4)
#define                                 T6CKPS0_bit         _BIT_ACCESS(T6CON,4)
// T6CON<T6CKPS1>
extern volatile __bit                   T6CKPS1             __at(0x20E5);	// @ (0x41C * 8 + 5)
#define                                 T6CKPS1_bit         _BIT_ACCESS(T6CON,5)
// T6CON<T6CKPS2>
extern volatile __bit                   T6CKPS2             __at(0x20E6);	// @ (0x41C * 8 + 6)
#define                                 T6CKPS2_bit         _BIT_ACCESS(T6CON,6)
// T6HLT<T6CKSYNC>
extern volatile __bit                   T6CKSYNC            __at(0x20ED);	// @ (0x41D * 8 + 5)
#define                                 T6CKSYNC_bit        _BIT_ACCESS(T6HLT,5)
// T6CLKCON<T6CS0>
extern volatile __bit                   T6CS0               __at(0x20F0);	// @ (0x41E * 8 + 0)
#define                                 T6CS0_bit           _BIT_ACCESS(T6CLKCON,0)
// T6CLKCON<T6CS1>
extern volatile __bit                   T6CS1               __at(0x20F1);	// @ (0x41E * 8 + 1)
#define                                 T6CS1_bit           _BIT_ACCESS(T6CLKCON,1)
// T6CLKCON<T6CS2>
